# Authored by : marigold2003
# Date : 2026-04-26
# Link : https://www.acmicpc.net/contest/problem/1675/10


import sys

input = sys.stdin.readline


# [Summary] J번 - Good Bye, BOJ!

# 다음 중 하나 이상의 문자열을 부분 문자열로 포함하는 문자열 S를 구하여라.
# 단 알파벳의 경우, 대소문자를 구별하지 않는다.

# BOJ
# Baekjoon
# 백준


def main() -> None:

    # [Ideas]

    # 백준의 마지막을 축하해 주자.

    ##########

    print(
        """

        결국 오지 않을 것 같았던 시간이 왔다


        아무 의미 없이 살았던 때가 있었다
        전역하고 복학까지 남은 시간 반 년
        그냥 아무것도 하지 않고 놀고자 했었다

        컴퓨터공학을 전공한다는 놈이 할 줄 아는 게 없다
        다음 학기에도 부모님 돈으로 대학에서 놀고먹을 생각뿐이다

        그 때 나는 백준을 알게 되었다.


        단계별로 풀어보기를 해보았다
        파이썬은 생각보다 쉬웠다
        1학년 때 교수가 가르치던 것보다 훨씬 재밌었다

        그렇게 하루에 두 문제, 세 문제씩 풀어 갔다
        어느새 골드에 도달해 있었다


        어느새 반 년이 흘러 개강을 했다
        수업이 너무나 쉬웠다. 모두 아는 내용이었다
        신기하게도 난 그 학기에 과탑이 되었다
        운 좋게 받은 전액장학금이 많은 도움이 되었다

        어느 순간 조금씩 일상이 되어 갔다
        하루에 골드 하나, 총 세 문제씩 푸는 습관이 생겼다
        플레티넘도 찍어 보고 오버레이팅도 높여 봤다

        운 좋게 대회에서 싸이버거를 받기도 했다

        교수님 눈에 띄어 학부생으로 연구실에 들어가서
        논문을 쓰기 시작했다. 즐거운 일이다


        그렇게 영원할 줄 알았던 사이트가 사라진다

        나의 은인과도 같은 곳이 이제 볼 수 없게 된다
        이 얼마나 슬픈 일인가

        만약 백준이 없었다면 내 인생이 어떻게 되었을까
        알 수 없는 일이다

        전역 후 반 년 동안 내가 뭘 했을지 짐작이 되지 않는다


        노력하지 않고 살기 위해서는 많은 노력이 필요하다
        그 사실을 깨닫게 해 준 것이 너야

        많이 고마웠다.
        1년도 되지 않는 짧은 시간이었지만
        너는 내 인생의 분기점이었어.

        비록 이별의 시간이 왔지만
        널 이곳에 두고 떠나가지만
        난 계속 앞으로 나갈게

        지켜봐줘


        막이 내리면 그리울까, 후련했고 섭섭했지.

        끝났다는 것은 다시 시작된다는 것을
        잊는다는 것도 역시 비워둔다는 것을


        중요한것은 끝까지 가는게 아니라
        어떻게 끝까지 가느냐

        그리고 난 새로운 끝을 향해서 힘차게 발을 내딛는다


        가끔 그리울 때 돌아올게
        다음에 또 보자

        """
    )

    print("최대 한계로 살고 싶어")
    print("노력하지 않고 살기 위해서는 많은 노력이 필요하다")
    print(
        "삶은 가진 열정을 불태우는 여정. 늦게 피어오르면, 그만큼 격렬히 불타오를 것이오."
    )

    print()
    print("Good Bye, BOJ!")

    ##########

    return


# [Review]

# ## BAEKJOON

# 2025.04.15 print("Hello, Baekjoon!")
# 2025.04.29 print("Hello, Solved!")
# 2025.05.13 100 solve !!!!!
# 2025.05.17 CLASS 1++
# 2025.05.20 CLASS 2
# 2025.06.03 Gold V 달성
# 2025.06.04 200 solve !!!!!
# 2025.07.03 300 solve !!!!! Gold III 1121
# 2025.07.29 CLASS 4
# 2025.07.29 Gold II 달성
# 2025.08.16 Gold I 달성
# 2025.08.17 400 solve !!!!!
# 2025.10.08 500 solve !!!!! Gold I 1469
# 2025.11.03 600 solve !!!!! Gold I 1490
# 2025.12.12 700 solve !!!!! Gold I 1514
# 2026.01.17 Platinum V 달성 feat. 801.271_1517
# 2026.01.18 800 solve !!!!! Platinum V 1627
# 2026.02.18 900 solve !!!!! Platinum V 1698
# 2026.02.18 ps갤컵3 싸이버거 당첨!!
# 2026.02.24 OVER RATING 12000 달성 !!!!!
# 2026.03.19 OVER RATING 13000 달성 !!!!!
# 2026.03.20 1000 solve !!!!! Platinum V 1726
# 2026.03.30 CLASS 5
# 2026.03.30 Platinum IV 달성
# 2026.04.26 print("Good Bye, BOJ!")


if __name__ == "__main__":
    main()
