
# 들어온 게 .이면 신경쓸 필요도 없다.
# 하지만 #이 들어오면, 그 숫자에도 #이 있어야 만들 수 있다.

nums = [
    ["###", "#.#", "#.#", "#.#", "###"],
    ["..#", "..#", "..#", "..#", "..#"],
    ["###", "..#", "###", "#..", "###"],
    ["###", "..#", "###", "..#", "###"],
    ["#.#", "#.#", "###", "..#", "..#"],
    ["###", "#..", "###", "..#", "###"],
    ["###", "#..", "###", "#.#", "###"],
    ["###", "..#", "..#", "..#", "..#"],
    ["###", "#.#", "###", "#.#", "###"],
    ["###", "#.#", "###", "..#", "###"],
]

clock = [list(input().split()) for _ in range(5)]
result = ""

# 시계 숫자 하나씩
for i in range(4):
    for m in range(10):
        # 숫자 행
        for j in range(5):
            clock_num_row = clock[j][i]
            # 숫자 열
            if clock_num_row[0] == '#' and nums[m][j][0] == '.':
                break
            if clock_num_row[1] == '#' and nums[m][j][1] == '.':
                break
            if clock_num_row[2] == '#' and nums[m][j][2] == '.':
                break
        else:
            result += str(m)
            break

print(f"{result[:2]}:{result[2:]}")




