# Authored by : marigold2003
# Date : 2026-02-17
# Link : https://www.acmicpc.net/problem/29701


import sys

input = sys.stdin.readline


# [Summary] 모스 부호

# 모스부호로 된 입력이 문자 사이에 공백을 두고 들어온다.
# 모스부호를 해독한 문자열을 출력하시오.


def main() -> None:

    # [Ideas]

    # 구현만 잘 하면 된다.
    # 다 옮겨야겠군. 딕셔너리로 만들면 되겠다.

    ##########

    morse_to_char = {
        ".-": "A",
        "-...": "B",
        "-.-.": "C",
        "-..": "D",
        ".": "E",
        "..-.": "F",
        "--.": "G",
        "....": "H",
        "..": "I",
        ".---": "J",
        "-.-": "K",
        ".-..": "L",
        "--": "M",
        "-.": "N",
        "---": "O",
        ".--.": "P",
        "--.-": "Q",
        ".-.": "R",
        "...": "S",
        "-": "T",
        "..-": "U",
        "...-": "V",
        ".--": "W",
        "-..-": "X",
        "-.--": "Y",
        "--..": "Z",
        ".----": "1",
        "..---": "2",
        "...--": "3",
        "....-": "4",
        ".....": "5",
        "-....": "6",
        "--...": "7",
        "---..": "8",
        "----.": "9",
        "-----": "0",
        "--..--": ",",
        ".-.-.-": ".",
        "..--..": "?",
        "---...": ":",
        "-....-": "-",
        ".--.-.": "@",
    }

    ##########

    N = int(input())
    morses = list(input().split())

    answer = []
    for morse in morses:
        answer.append(morse_to_char[morse])

    print("".join(answer))

    ##########

    return


# [Review]

# 이런 노가다 작업은 다른 사람 시키자고요.


if __name__ == "__main__":
    main()
